Core/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1СРарусФискальныеРегистраторыМебиус</name>
      <description>1С-Рарус:Фискальные регистраторы Мебиус</description>
    </items>
    <items>
      <name>Драйвер1СРарусФискальныеРегистраторыФеликс</name>
      <description>1С-Рарус:Фискальные регистраторы Феликс</description>
    </items>
    <items>
      <name>Драйвер1СWebСервисОборудование</name>
      <description>1С:Web-сервис оборудование</description>
    </items>
    <items>
      <name>Драйвер1СДисплейПокупателя</name>
      <description>1С:Дисплей покупателя</description>
    </items>
    <items>
      <name>Драйвер1СККМOffline</name>
      <description>1С:ККМ Offline</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1ССканерыШтрихкода</name>
      <description>1С:Сканеры штрихкода (COM)</description>
    </items>
    <items>
      <name>Драйвер1ССканерыШтрихкодаNative</name>
      <description>1С:Сканеры штрихкода (NativeApi)</description>
    </items>
    <items>
      <name>Драйвер1ССчитывателиМагнитныхКарт</name>
      <description>1С:Считыватели магнитных карт</description>
    </items>
    <items>
      <name>Драйвер1ССчитывателиМагнитныхКартNative</name>
      <description>1С:Считыватели магнитных карт (NativeApi)</description>
    </items>
    <items>
      <name>Драйвер1СФискальныйРегистраторЭмулятор</name>
      <description>1С:Фискальный регистратор (эмулятор)</description>
    </items>
    <items>
      <name>Драйвер1СЭквайринговыеТерминалыСбербанк</name>
      <description>1С:Эквайринговые терминалы Сбербанк</description>
    </items>
    <items>
      <name>ДрайверACOMВесыСПечатьюЭтикеток</name>
      <description>ACOM:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверARCUS2ЭквайринговыеТерминалыIngenico</name>
      <description>ARCUS2:Эквайринговые терминалы Ingenico</description>
    </items>
    <items>
      <name>ДрайверCASВесыСПечатьюЭтикеток</name>
      <description>CAS:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверCASЭлектронныеВесы</name>
      <description>CAS:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверERFIDСчитывательRFID</name>
      <description>ERFID:Считыватель RFID</description>
    </items>
    <items>
      <name>ДрайверIboxProПоддержкаMPosЭквайринга</name>
      <description>iboxPro:Поддержка mPos эквайринга</description>
    </items>
    <items>
      <name>ДрайверIronLogicСчитывателиБесконтактныхКарт</name>
      <description>IronLogic:Считыватели бесконтактных карт Z-2</description>
    </items>
    <items>
      <name>ДрайверISBCСчитывательRFID</name>
      <description>ISBC:Считыватель RFID</description>
    </items>
    <items>
      <name>ДрайверTRPOSЭквайринговыеТерминалы</name>
      <description>TRPOS:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверUCSEFTPOSЭквайринговыеТерминалы</name>
      <description>UCS-EFTPOS:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверАТОЛВесыСПечатьюЭтикеток8X</name>
      <description>АТОЛ:Весы c печатью этикеток 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолДисплеиПокупателя</name>
      <description>АТОЛ:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверАтолДисплеиПокупателя8X</name>
      <description>АТОЛ:Дисплеи покупателя 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолККТ54ФЗ</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАтолККМOffline</name>
      <description>АТОЛ:Рабочее место кассира</description>
    </items>
    <items>
      <name>ДрайверАтолСканерыШтрихкода</name>
      <description>АТОЛ:Сканеры штрихкода</description>
    </items>
    <items>
      <name>ДрайверАтолСканерыШтрихкода8X</name>
      <description>АТОЛ:Сканеры штрихкода 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолСчитывателиМагнитныхКарт</name>
      <description>АТОЛ:Считыватели магнитных карт</description>
    </items>
    <items>
      <name>ДрайверАтолСчитывателиМагнитныхКарт8X</name>
      <description>АТОЛ:Считыватели магнитных карт 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолТерминалыСбораДанных</name>
      <description>АТОЛ:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверАтолТерминалыСбораДанныхMobileLogistics</name>
      <description>АТОЛ:Терминалы сбора данных MobileLogistics 8.Х</description>
    </items>
    <items>
      <name>ДрайверАтолФискальныеРегистраторыУниверсальный</name>
      <description>АТОЛ:Фискальные регистраторы (Универсальный)</description>
    </items>
    <items>
      <name>ДрайверАтолФискальныеРегистраторы</name>
      <description>АТОЛ:Фискальные регистраторы 6.Х</description>
    </items>
    <items>
      <name>ДрайверАтолФискальныеРегистраторы8X</name>
      <description>АТОЛ:Фискальные регистраторы 8.Х</description>
    </items>
    <items>
      <name>ДрайверАтолЭлектронныеВесы</name>
      <description>АТОЛ:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверАтолЭлектронныеВесы8X</name>
      <description>АТОЛ:Электронные весы 8.Х</description>
    </items>
    <items>
      <name>ДрайверВерсияТФискальныеРегистраторы</name>
      <description>Версия-Т:Фискальные регистратоы КАСБИ</description>
    </items>
    <items>
      <name>ДрайверГАЗПРОМБАНКЭквайринговыеТерминалы</name>
      <description>ГАЗПРОМБАНК:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверГексагонПринтераЭтикеток</name>
      <description>Гексагон:Принтера этикеток Zebra,Proton,Toshiba-TEC,Datamax-O neil</description>
    </items>
    <items>
      <name>ДрайверГексагонСканерыШтрихкода</name>
      <description>Гексагон:Сканеры штрихкода Proton</description>
    </items>
    <items>
      <name>ДрайверГексагонТерминалыСбораДанных</name>
      <description>Гексагон:Терминалы сбора данных Goods</description>
    </items>
    <items>
      <name>ДрайверИскраФискальныеРегистраторыПрим</name>
      <description>Драйвер &quot;Искра:Фискальные регистраторы Прим&quot;</description>
    </items>
    <items>
      <name>ДрайверDATECSФискальныйРегистратор</name>
      <description>Драйвер DATECS Фискальный регистратор</description>
    </items>
    <items>
      <name>ДрайверОптимусФискальныйРегистратор</name>
      <description>Драйвер оптимус фискальный регистратор</description>
    </items>
    <items>
      <name>ДрайверДримкасФискальныеРегистраторыVikiPrint</name>
      <description>Дримкас:Фискальные регистраторы VikiPrint</description>
    </items>
    <items>
      <name>ДрайверИНПАСЭквайринговыеТерминалыSmart</name>
      <description>ИНПАС:Эквайринговые терминалы Smart</description>
    </items>
    <items>
      <name>ДрайверИНПАСЭквайринговыеТерминалыUNIPOS</name>
      <description>ИНПАС:Эквайринговые терминалы UNIPOS</description>
    </items>
    <items>
      <name>ДрайверККСДисплеиПокупателя</name>
      <description>ККС:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверККСФискальныеРегистраторы</name>
      <description>ККС:Фискальные регистраторы Спарк</description>
    </items>
    <items>
      <name>ДрайверКлеверенсСчитывателиRFID</name>
      <description>Клеверенс:Считыватели RFID</description>
    </items>
    <items>
      <name>ДрайверКлеверенсТерминалыСбораДанных</name>
      <description>Клеверенс:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверКристаллСервисДисплеиПокупателяVikiVision</name>
      <description>Кристалл Сервис:Дисплей покупателя VikiVision</description>
    </items>
    <items>
      <name>ДрайверКристаллСервисФискальныеРегистраторыPirit</name>
      <description>Кристалл Сервис:Фискальные регистраторы Pirit</description>
    </items>
    <items>
      <name>ДрайверМассаКВесыСПечатьюЭтикеток</name>
      <description>Масса-К:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверМассаКЭлектронныеВесы</name>
      <description>Масса-К:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверОРИОНФискальныеРегистраторы</name>
      <description>ОРИОН:Фискальный регистратор ФР01К</description>
    </items>
    <items>
      <name>ДрайверСБРФЭквайринговыеТерминалы</name>
      <description>СБРФ:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверСканкодДисплеиПокупателя</name>
      <description>Сканкод:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверСканкодПринтераЭтикетокGodexEZPL8Native</name>
      <description>Сканкод:Принтера этикетокGodexEZPL8 (NativeAPI)</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерыШтрихкода</name>
      <description>Сканкод:Сканеры штрихкода</description>
    </items>
    <items>
      <name>ДрайверСканкодСчитывательRFIDCipherLab</name>
      <description>Сканкод:Считыватели RFID CipherLab</description>
    </items>
    <items>
      <name>ДрайверСканкодТерминалыСбораДанных</name>
      <description>Сканкод:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверСканкодТерминалыСбораДанныхNative</name>
      <description>Сканкод:Терминалы сбора данных CipherLAB 8x00 (NativeApi)</description>
    </items>
    <items>
      <name>ДрайверСканситиПринтераЭтикеток</name>
      <description>Скансити:Принтер печати этикеток TSC</description>
    </items>
    <items>
      <name>ДрайверСканситиТерминалыСбораДанных</name>
      <description>Скансити:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверШтрихМВесыСПечатьюЭтикеток</name>
      <description>Штрих-М:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверШтрихМДисплеиПокупателя</name>
      <description>Штрих-М:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверШтрихМККМOffline</name>
      <description>Штрих-М:Кассир</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗ</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверШтрихМПлатежныйТерминалYarus</name>
      <description>Штрих-М:Платежный терминал Yarus</description>
    </items>
    <items>
      <name>ДрайверШтрихМТерминалыСбораДанных</name>
      <description>Штрих-М:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверШтрихМФискальныеРегистраторы</name>
      <description>Штрих-М:Фискальные регистраторы</description>
    </items>
    <items>
      <name>ДрайверШтрихМФискальныеРегистраторыУниверсальный</name>
      <description>Штрих-М:Фискальные регистраторы (Универсальный)</description>
    </items>
    <items>
      <name>ДрайверШтрихМЭлектронныеВесы</name>
      <description>Штрих-М:Электронные весы</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяДистрибутивом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженныйДрайвер</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДрайвера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМакетаДрайвера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СнятСПоддержки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ДрайверыОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПолноеИмяФайла") Тогда
		ИмяФайлДрайвераДляЗагрузки = Параметры.ПолноеИмяФайла;
	КонецЕсли;
	
	РевизияИнтерфейса = 0;
	ДополнительнаяИнформация = "";
	ПоставляемыйВСоставеКонфигурации = Объект.Предопределенный;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПоставляетсяДистрибутивом = Истина;
	КонецЕсли;
	
	Если НЕ ПоставляемыйВСоставеКонфигурации И НЕ ПустаяСтрока(Объект.ИмяФайлаДрайвера) Тогда
		СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ЗагруженныйДрайвер");
		ИмяФайлДрайвераНаФорме = Объект.ИмяФайлаДрайвера;
	КонецЕсли;
	
	Элементы.ИмяФайлаДрайвера.Видимость = НЕ ПоставляемыйВСоставеКонфигурации;
	Элементы.ИмяМакетаДрайвера.Видимость = ПоставляемыйВСоставеКонфигурации;
	Элементы.ТипОборудования.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	Элементы.Наименование.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	Элементы.ИдентификаторОбъекта.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	Элементы.ИдентификаторОбъекта.ПодсказкаВвода = ?(ПоставляемыйВСоставеКонфигурации, НСтр("ka='<მითითებული არ არის>';ru='<Не указан>';en='<Not Set>'"), 
		НСтр("ka='<ProgID компоненты не введен>';ru='<ProgID компоненты не введен>';en='<ProgID components are introduced>'"));
	Элементы.ИмяМакетаДрайвера.ПодсказкаВвода = ?(ПоставляемыйВСоставеКонфигурации, НСтр("ka='<მითითებული არ არის>';ru='<Не указан>';en='<Not Set>'"), "");
	
	Элементы.Сохранить.Видимость = НЕ ПоставляемыйВСоставеКонфигурации;
	Элементы.ЗаписатьИЗакрыть.Видимость = НЕ ПоставляемыйВСоставеКонфигурации;
	Элементы.ФормаЗакрыть.Видимость =ПоставляемыйВСоставеКонфигурации;
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Элементы.ФормаЗакрыть.Видимость;
	
	Элементы.СнятСПоддержки.Видимость = Объект.СнятСПоддержки;
	
	// Загрузка и установка списка доступных макетов с драйверами.
	Для каждого МакетДрайвера Из Метаданные.ОбщиеМакеты Цикл
		Если Найти(МакетДрайвера.Имя, "Драйвер") > 0 Тогда
			Элементы.ИмяМакетаДрайвера.СписокВыбора.Добавить(МакетДрайвера.Имя);
		КонецЕсли;
	КонецЦикла;  
	
	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветУстановки = ЦветаСтиля.ЦветФонаВыделенияПоля;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПустаяСтрока(ИмяФайлДрайвераДляЗагрузки) Тогда
	#Если НЕ ВебКлиент Тогда
		ПолучитьИнформациюДрайвераПоФайлу(ИмяФайлДрайвераДляЗагрузки);
	#КонецЕсли
	Иначе
		ОбновитьСостояниеЭлементов();
		Если НЕ ПустаяСтрока(Объект.Ссылка) Тогда
			ОбновитьСтатусДрайвера();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Получить файл из хранилища и поместить его в объект.
	Если НЕ ПоставляемыйВСоставеКонфигурации И ЭтоАдресВременногоХранилища(СсылкаНаДрайвер) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаДрайвер);
		ТекущийОбъект.ЗагруженныйДрайвер = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(5));
		ТекущийОбъект.ИмяФайлаДрайвера = ИмяФайлДрайвераНаФорме;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ ПоставляемыйВСоставеКонфигурации И НЕ ПустаяСтрока(Объект.ИмяФайлаДрайвера) Тогда
		СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ЗагруженныйДрайвер");
		ИмяФайлДрайвераНаФорме = Объект.ИмяФайлаДрайвера;
	КонецЕсли;
	
	ОбновитьСостояниеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.ТипОборудования) Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='მოწყობილობის ტიპი არ არის მითითებული.';ru='Тип оборудования не указан.';en='equipment type not specified.'")); 
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='სახელწოდება არ არის მითითებული.';ru='Наименование не указано.';en='Name not specified.'")); 
		Возврат;
	КонецЕсли;
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьДрайверКоманда(Команда)
	
	Если Модифицированность Тогда
		Текст = НСтр("ru='Продолжение операции возможно только после записи данных."
"Записать данные и продолжить?';ka='ოპერაციის გაგრძელება შესაძლებელია მხოლოდ მონაცემთა ჩაწერის შემდეგ. ჩავწეროთ მონაცემები და გავაგრძელოთ?'");
		Оповещение = Новый ОписаниеОповещения("УстановитьДрайверКоманда_Завершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
	Иначе
		УстановитьДрайвер();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайверКоманда_Завершение(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Модифицированность И НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		УстановитьДрайвер();
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлДрайвераКоманда(Команда)
	
	Если ПоставляемыйВСоставеКонфигурации Тогда
		
		Если ПустаяСтрока(Объект.ИмяМакетаДрайвера) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='დრაივერის მაკეტის სახელი არ არის მითითებული.';ru='Имя макета драйвера не указано.';en='Driver name layout is not specified.'"));
			Возврат;
		Иначе
			ВыгрузитьМакетДрайвера();
		КонецЕсли;   
		
	Иначе 
		
		Если ПустаяСтрока(Объект.ИмяФайлаДрайвера) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='დრაივერის ფაილი არ არის ჩატვირთული.';ru='Файл драйвера не загружен.';en='The driver file is not loaded.'"));
			Возврат;
		КонецЕсли;
		
		Если Модифицированность Тогда
			Текст = НСтр("ru='Продолжение операции возможно только после записи данных."
"Записать данные и продолжить?';ka='ოპერაციის გაგრძელება შესაძლებელია მხოლოდ მონაცემთა ჩაწერის შემდეგ. ჩავწეროთ მონაცემები და გავაგრძელოთ?'");
			Оповещение = Новый ОписаниеОповещения("ВыгрузитьФайлДрайвераКоманда_Завершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыгрузитьФайлДрайвера();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлДрайвераКоманда_Завершение(Результат, Параметры)Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Модифицированность И НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		ВыгрузитьФайлДрайвера();
	КонецЕсли;  
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьФайлДрайвераКоманда(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(, НСтр("ka='მოცემული ფუნქციონალი ხელმისაწვდომია მხოლოდ თხელი და მსხვილი კლიენტის რეჟიმში.';ru='Данный функционал доступен только в режиме тонкого и толстого клиента.';en='This functionality is only available in thin and thick client mode.'"));
		Возврат;
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлДрайвераКоманда_ВыборФайлаЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьВыборФайлаДрайвера(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлДрайвераКоманда_ВыборФайлаЗавершение(ПолноеИмяФайла, Параметры) Экспорт
	
	Если Не ПустаяСтрока(ПолноеИмяФайла) Тогда
		ПолучитьИнформациюДрайвераПоФайлу(ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьИнформациюДрайвераПоФайлу(ПолноеИмяФайла) 
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИнформациюДрайвераПоФайлу_ИнициализацияФайлаЗавершение", ЭтотОбъект, ПараметрыВыполнения);
	ФайлДрайвера = Новый Файл();
	ФайлДрайвера.НачатьИнициализацию(Оповещение, ПолноеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнформациюДрайвераПоФайлу_ИнициализацияФайлаЗавершение(ФайлДрайвера, ПараметрыВыполнения) Экспорт 
	
	ПараметрыВыполнения.Вставить("ФайлДрайвера", ФайлДрайвера);
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИнформациюДрайвераПоФайлу_Завершение", ЭтотОбъект, ПараметрыВыполнения);
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнформациюДрайвераПоФайлу_Завершение(Результат, ПараметрыВыполнения) Экспорт 
	
	ВременныйКаталог = Результат + "cel\";
	
	ИмяФайла              = ПараметрыВыполнения.ФайлДрайвера.Имя;
	ИмяФайлаПолное        = ПараметрыВыполнения.ФайлДрайвера.ПолноеИмя;
	ИмяФайлаБезРасширения = ПараметрыВыполнения.ФайлДрайвера.ИмяБезРасширения;
	ИмяФайлаРасширение    = ВРег(ПараметрыВыполнения.ФайлДрайвера.Расширение);
	
	Если НЕ МенеджерОборудованияКлиентПовтИсп.ЭтоLinuxКлиент() И ИмяФайлаРасширение = ".EXE" Тогда
		
		// Файл драйвера поставляется дистрибутивом.
		Объект.ПоставляетсяДистрибутивом = Истина; 
		ЗагрузитьФайлДрайвераВБазу(ИмяФайлаПолное, ИмяФайла);
		                                      
	ИначеЕсли ИмяФайлаРасширение = ".ZIP" Тогда
		
		АрхивДрайвера = Новый ЧтениеZipФайла();
		АрхивДрайвера.Открыть(ИмяФайлаПолное);
		
		Для Каждого ЭлементАрхива Из АрхивДрайвера.Элементы Цикл
			МанифестНайден = Ложь;
			
			// Проверяем, есть ли файл манифеста.
			Если ВРег(ЭлементАрхива.Имя) = "MANIFEST.XML" Тогда
				Объект.ПоставляетсяДистрибутивом = Ложь; 
				МанифестНайден = Истина;
			КонецЕсли;
			
			// Проверяем, есть ли файл информации.
			Если ВРег(ЭлементАрхива.Имя) = "INFO.XML" Тогда
				
				АрхивДрайвера.Извлечь(ЭлементАрхива, ВременныйКаталог);
				
				ФайлИнформации = Новый ЧтениеТекста(ВременныйКаталог + "INFO.XML", КодировкаТекста.UTF8);
				ПрочитатьИнформацииОДрайвере(ФайлИнформации.Прочитать());
				ФайлИнформации.Закрыть(); 
				
				НачатьУдалениеФайлов(, ВременныйКаталог + "INFO.XML");
			КонецЕсли;
			
			// Драйвер поставляется дистрибутивом упакованным в архив.
			Если НЕ МенеджерОборудованияКлиентПовтИсп.ЭтоLinuxКлиент() И НЕ МанифестНайден Тогда
				Если (ВРег(ЭлементАрхива.Имя) = "SETUP.EXE" 
					Или ВРег(ЭлементАрхива.Имя) = ВРег(ИмяФайлаБезРасширения) + ".EXE") Тогда
						Объект.ПоставляетсяДистрибутивом = Истина; 
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПустаяСтрока(Объект.ИдентификаторОбъекта) Тогда
			Объект.ИдентификаторОбъекта = "AddIn.None";
		КонецЕсли;
		
		ЗагрузитьФайлДрайвераВБазу(ИмяФайлаПолное, ИмяФайла);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ka='ფაილის არასწორი გაფართოება.';ru='Неверное расширение файла.';en='Invalid file extension.'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьИнформацииОДрайвере(ИнформацияФайла)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ИнформацияФайла);
	ЧтениеXML.ПерейтиКСодержимому();
	
	Если ЧтениеXML.Имя = "drivers" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
		Пока ЧтениеXML.Прочитать() Цикл 
			Если ЧтениеXML.Имя = "component" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				Объект.ИдентификаторОбъекта = ЧтениеXML.ЗначениеАтрибута("progid");
				Объект.Наименование = ЧтениеXML.ЗначениеАтрибута("name");
				Объект.ВерсияДрайвера = ЧтениеXML.ЗначениеАтрибута("version");
				ВремТипОборудования = ЧтениеXML.ЗначениеАтрибута("type");
				Если НЕ ПустаяСтрока(ВремТипОборудования) Тогда
					Объект.ТипОборудования = МенеджерОборудованияВызовСервера.ПолучитьТипОборудования(ВремТипОборудования);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
	КонецЕсли;
	ЧтениеXML.Закрыть(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлДрайвераВБазу(ПолноеИмяФайла, ИмяФайла) Экспорт 
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлДрайвераВБазу_Завершение", ЭтотОбъект, ИмяФайла);
	НачатьПомещениеФайлов(Оповещение, Неопределено, ПолноеИмяФайла, Ложь) 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлДрайвераВБазу_Завершение(ПомещенныеФайлы, ИмяФайла) Экспорт 
	
	Если ПомещенныеФайлы.Количество() > 0 Тогда
		ИмяФайлДрайвераНаФорме = ИмяФайла;
		СсылкаНаДрайвер = ПомещенныеФайлы[0].Хранение;
		ОбновитьСостояниеЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеРевизииИнтерфейса(РевизияИнтерфейса)
	
	Результат = "";                    
	
	Если НоваяАрхитектура Тогда
		Если РевизияИнтерфейса >= 2000 Тогда
			Результат = Символы.НПП + НСтр("ka='(დრაივერების შემუშავებისადმი არსებული მოთხოვნების ვერსია %Версия%)';ru='(Версия требований к разработке драйверов %Версия%)';en='(Version requirements for the development of drivers% version%)'");
			Результат = СтрЗаменить(Результат, "%Версия%", "2." + Строка(РевизияИнтерфейса - 2000));
		ИначеЕсли РевизияИнтерфейса > 1000 Тогда
			Результат = Символы.НПП + НСтр("ka='(დრაივერების შემუშავებისადმი არსებული მოთხოვნების ვერსია %Версия%)';ru='(Версия требований к разработке драйверов %Версия%)';en='(Version requirements for the development of drivers% version%)'");
			Результат = СтрЗаменить(Результат, "%Версия%", "1." + Строка(РевизияИнтерфейса - 1000));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекущийСтатусДрайвера()
	
	Если НоваяАрхитектура И ИнтеграционныйКомпонент Тогда
		ТекущийСтатусДрайвера = НСтр("ka='დაყენებულია საინტეგრაციო კომპონენტი.';ru='Установлен интеграционный компонент.';en='Installed integrative component.'") + Символы.НПП;
		ТекущийСтатусДрайвера = ТекущийСтатусДрайвера + ?(ОсновнойДрайверУстановлен, НСтр("ka='დაყენებულია დრაივერის ძირითადი მიწოდება.';ru='Установлена основная поставка драйвера.';en='The basic delivery driver.'"),
																					 НСтр("ka='დრაივერის ძირითადი მიწოდება არ არის დაყენებული.';ru='Основная поставка драйвера не установлена.';en='The main supply is not installed driver.'")); 
	Иначе
		ТекущийСтатусДрайвера = НСтр("ka='დაყენებულია მიმდინარე კომპიუტერზე.';ru='Установлен на текущем компьютере.';en='Installed on your computer.'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекущаяВерсия) Тогда
		УстановленнаяВерсия = ТекущаяВерсия + ПолучитьОписаниеРевизииИнтерфейса(РевизияИнтерфейса);
		Элементы.УстановленнаяВерсия.Видимость = Истина;
	Иначе
		Элементы.УстановленнаяВерсия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНомерВерсииЗавершение(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт;
	
	Если Не ПустаяСтрока(РезультатВызова) Тогда
		ТекущаяВерсия = РезультатВызова;
		ОбновитьТекущийСтатусДрайвера();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОписаниеЗавершение(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт;
	
	НоваяАрхитектура = Истина;
	НаименованиеДрайвера = ПараметрыВызова[0];
	ОписаниеДрайвера     = ПараметрыВызова[1];
	ТипОборудования      = ПараметрыВызова[2]; 
	РевизияИнтерфейса    = ПараметрыВызова[3];
	ИнтеграционныйКомпонент   = ПараметрыВызова[4];
	ОсновнойДрайверУстановлен = ПараметрыВызова[5];
	URLЗагрузкиДрайвера       = ПараметрыВызова[6];
	ОбновитьТекущийСтатусДрайвера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеОбъектаДрайвераЗавершение(ОбъектДрайвера, Параметры) Экспорт
	
	Если ПустаяСтрока(Объект.ИдентификаторОбъекта) И ПоставляемыйВСоставеКонфигурации Тогда
		ТекущийСтатусДрайвера = НСтр("ka='დრაივერის დაყენება არ არის საჭირო.';ru='Установка драйвера не требуется.';en='No drivers are required.'");
	ИначеЕсли ПустаяСтрока(ОбъектДрайвера) Тогда
		ТекущийСтатусДрайвера = НСтр("ka='მიმდინარე კომპიუტერზე არ არის დაყენებული. დადგენილი არ არის ტიპი:';ru='Не установлен на текущем компьютере. Не определен тип:';en='Is not installed on your computer. Not defined Type:'") + Символы.НПП + Объект.ИдентификаторОбъекта;
		Элементы.ТекущийСтатусДрайвера.ЦветТекста = ЦветОшибки;
		Элементы.УстановленнаяВерсия.ЦветТекста = ЦветОшибки;
	Иначе
		Элементы.ФормаУстановитьДрайвер.Доступность = Ложь;
		Элементы.ТекущийСтатусДрайвера.ЦветТекста = ЦветУстановки;
		Элементы.УстановленнаяВерсия.ЦветТекста = ЦветУстановки;
		ТекущаяВерсия = "";
		Попытка
			ОповещениеМетода = Новый ОписаниеОповещения("ПолучитьНомерВерсииЗавершение", ЭтотОбъект);
			ОбъектДрайвера.НачатьВызовПолучитьНомерВерсии(ОповещениеМетода);
		Исключение
			ОбновитьТекущийСтатусДрайвера()
		КонецПопытки;
		
		Попытка
			НоваяАрхитектура          = Ложь;
			НаименованиеДрайвера      = "";
			ОписаниеДрайвера          = "";
			ТипОборудования           = "";
			ИнтеграционныйКомпонент   = Ложь;
			ОсновнойДрайверУстановлен = Ложь;
			РевизияИнтерфейса         = МенеджерОборудованияКлиентПовтИсп.РевизияИнтерфейсаДрайверов();
			URLЗагрузкиДрайвера       = "";
			ОповещениеМетода = Новый ОписаниеОповещения("ПолучитьОписаниеЗавершение", ЭтотОбъект);
			ОбъектДрайвера.НачатьВызовПолучитьОписание(ОповещениеМетода, НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, 
											ИнтеграционныйКомпонент, ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
		Исключение
			ОбновитьТекущийСтатусДрайвера()
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусДрайвера();
	
	ДанныеДрайвера = Новый Структура();
	ДанныеДрайвера.Вставить("ДрайверОборудования"       , Объект.Ссылка);
	ДанныеДрайвера.Вставить("ВСоставеКонфигурации"      , Объект.Предопределенный);
	ДанныеДрайвера.Вставить("ИдентификаторОбъекта"      , Объект.ИдентификаторОбъекта);
	ДанныеДрайвера.Вставить("ПоставляетсяДистрибутивом" , Объект.ПоставляетсяДистрибутивом);
	ДанныеДрайвера.Вставить("ИмяМакетаДрайвера"         , Объект.ИмяМакетаДрайвера);
	ДанныеДрайвера.Вставить("ИмяФайлаДрайвера"          , Объект.ИмяФайлаДрайвера);
	
	Элементы.ТекущийСтатусДрайвера.ЦветТекста = ЦветТекста;
	
	Оповещение = Новый ОписаниеОповещения("ПолучениеОбъектаДрайвераЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПолучениеОбъектаДрайвера(Оповещение, ДанныеДрайвера);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеЭлементов();
	
	Если ПоставляемыйВСоставеКонфигурации И ПустаяСтрока(Объект.ИмяМакетаДрайвера) Тогда
		ВидимостьВыгрузитьФайл = Ложь;
	ИначеЕсли НЕ ПоставляемыйВСоставеКонфигурации И ПустаяСтрока(ИмяФайлДрайвераНаФорме) Тогда
		ВидимостьВыгрузитьФайл = Ложь;
	Иначе
		ВидимостьВыгрузитьФайл = НЕ ПустаяСтрока(Объект.Ссылка);
	КонецЕсли;
		
	Элементы.ФормаВыгрузитьФайлДрайвера.Видимость = ВидимостьВыгрузитьФайл;
	Элементы.ФормаУстановитьДрайвер.Видимость     = ВидимостьВыгрузитьФайл;
	Элементы.ФормаЗагрузитьФайлДрайвера.Видимость = НЕ ПоставляемыйВСоставеКонфигурации;
	
	Если НЕ ПустаяСтрока(ИмяФайлДрайвераНаФорме) Или ПоставляемыйВСоставеКонфигурации Тогда
		Если ПустаяСтрока(Объект.ИдентификаторОбъекта) Тогда
			ДополнительнаяИнформация = НСтр("ka='კომპონენტის ProgID არ არის მითითებული, ან დრაივერის დაყენება არ არის საჭირო.';ru='Не указан ProgID компоненты или установка драйвера не требуется.';en='Unknown ProgID components or driver installation is not required.'");
		ИначеЕсли Объект.ПоставляетсяДистрибутивом Тогда
			ДополнительнаяИнформация = НСтр("ka='დრაივერის მოწოდება ხდება მომწოდებლის დისტრიბუტივის სახით.';ru='Драйвер поставляется в виде дистрибутива поставщика.';en='The driver comes in the form of a distribution vendor.'");
		Иначе
			ДополнительнаяИнформация = НСтр("ka='დრაივერის მოწოდება ხორციელდება არქივის სახით.';ru='Драйвер поставляется в виде архива.';en='The driver is supplied as an archive.'")
				+ ?(ПустаяСтрока(Объект.ВерсияДрайвера), "", Символы.ПС + НСтр("ka='დრაივერის ვერსია არქივში:';ru='Версия драйвера в архиве:';en='Driver version in the archive:'")
				+ Символы.НПП + Объект.ВерсияДрайвера);
		КонецЕсли;
	Иначе
		ДополнительнаяИнформация = НСтр("ka='დაყენებული დრაივერის შეერთება ლოკალურ კომპიუტერებზე.';ru='Подключение установленного драйвера на локальных компьютерах.';en='Connecting the driver installed on the local computer.'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМакетДрайвера()
	
	ВремИмяФайла = ?(ПустаяСтрока(Объект.ИмяФайлаДрайвера), Объект.ИмяМакетаДрайвера + ".zip", Объект.ИмяФайлаДрайвера);
	Если ВРег(Прав(ВремИмяФайла, 4)) = ".EXE" Тогда  
		ВремИмяФайла = Лев(ВремИмяФайла, СтрДлина(ВремИмяФайла) - 4) + ".zip";  
	КонецЕсли;
	СсылкаНаФайл = МенеджерОборудованияВызовСервера.ПолучитьМакетССервера(Объект.ИмяМакетаДрайвера);
	ПолучитьФайл(СсылкаНаФайл, ВремИмяФайла); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлДрайвера()
	
	СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ЗагруженныйДрайвер");
	ПолучитьФайл(СсылкаНаФайлВИБ, Объект.ИмяФайлаДрайвера); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайверИзАрхиваПриЗавершении(Результат) Экспорт 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Установка драйвера завершена.';ru='Установка драйвера завершена.';en='Installation is complete driver.'")); 
	ОбновитьСтатусДрайвера();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДрайверИзДистрибутиваПриЗавершении(Результат, Параметры) Экспорт 
	
	Если Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Установка драйвера завершена.';ru='Установка драйвера завершена.';en='Installation is complete driver.'")); 
		ОбновитьСтатусДрайвера();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='При установке драйвера из дистрибутива произошла ошибка.';ru='При установке драйвера из дистрибутива произошла ошибка.';en='An error occurred while installing the driver from the distribution.'")); 
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДрайвер()
	
	ОчиститьСообщения();
	
	ОповещенияДрайверИзДистрибутиваПриЗавершении = Новый ОписаниеОповещения("УстановитьДрайверИзДистрибутиваПриЗавершении", ЭтотОбъект);
	ОповещенияДрайверИзАрхиваПриЗавершении = Новый ОписаниеОповещения("УстановитьДрайверИзАрхиваПриЗавершении", ЭтотОбъект);
	
	МенеджерОборудованияКлиент.УстановитьДрайвер(Объект.Ссылка, ОповещенияДрайверИзДистрибутиваПриЗавершении, ОповещенияДрайверИзАрхиваПриЗавершении);
	
КонецПроцедуры

#КонецОбласти
